Tekla.Structures.Model.GridExtensions
The Tekla.Structures.Model.GridExtensions class provides a set of methods to query instances of the Tekla.Structures.Model.Grid type.

Tekla.Structures.Model.GridExtensions.TryGetClosestSegmentTo(Tekla.Structures.Model.Grid,Tekla.Common.Geometry.Vector3,Tekla.BIM.DirectManipulation.Services.Graphics.IGraphicsViewInfo,Tekla.Common.Geometry.Segment3@)
Tries to get the Tekla.Structures.Model.Grid segment that is closest to the given point.
View data is used to determine the plane from which the segments are calculated.
grid: The Tekla.Structures.Model.Grid to get a segment for.
point: The Tekla.Common.Geometry.Vector3 to get the closest segment to.
viewData: The view data associated with the grid.
closestSegment: The grid segment Tekla.Common.Geometry.Segment3 that is closest to point.
Returns: True on success; Otherwise, false.

Tekla.Structures.Model.GridExtensions.GetGridLinesOnPlane(Tekla.Structures.Model.Grid,System.Nullable{Tekla.Common.Geometry.Plane3})
Gets the grid lines on the given plane.
grid: The Tekla.Structures.Model.Grid to get the segments from.
plane: The plane on which the lines will be located.
Returns: An IList representing the grid lines on the given plane.

Tekla.Structures.Model.GridExtensions.GetGridSegmentsOnPlane(Tekla.Structures.Model.Grid,System.Nullable{Tekla.Common.Geometry.Plane3})
Gets the grid segments on the given plane.
grid: The Tekla.Structures.Model.Grid to get the segments from.
plane: The plane on which the segments will be located.
Returns: An IEnumerable representing the grid segments on the given plane.

Tekla.Structures.Model.GridExtensions.IntersectionWith(Tekla.Structures.Model.GridPlane,Tekla.Common.Geometry.Plane3,System.Boolean)
Calculates the intersection segment of the grid plane rectangle with the given plane.
gridPlane: The grid plane.
plane: The plane to calculate the intersection with.
includeExtension: Whether to include extension distances.
Returns:
Intersection segment of the grid plane rectangle with the given plane or null if the planes are parallel.

Tekla.Structures.Model.GridExtensions.GetLimitedSegment(Tekla.Structures.Model.GridPlane,Tekla.Common.Geometry.Line3,System.Boolean,System.Boolean)
Limits the given line using the grid plane rectangle. The line has to be on the grid plane.
gridPlane: The grid plane.
line: The line to limit.
includeExtensions: Indicates whether to include the extensions into the rectangle.
lineMustIntersectEdge:
Indicates whether only points where the line intersects a rectangle edge are handled.
Returns:
The limited line as a segment or null if it was not possible to limit the line.

Tekla.Structures.Model.GridExtensions.GetVertices(Tekla.Structures.Model.GridPlane,System.Boolean)
Calculates the vertices of the grid plane.
gridPlane: The grid plane.
includeExtensions: Whether to include extension distances.
Returns: The grid vertices.